Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	СкладКИО1	= Справочники.Склады.НайтиПоНаименованию("Камера охлаждения 1");
	СкладКИО2 =  Справочники.Склады.НайтиПоНаименованию("Камера охлаждения 2");
	СкладКИО8	= Справочники.Склады.НайтиПоНаименованию("Камера охлаждения 8");

	//	СкладСозревания = Справочники.Склады.НайтиПоНаименованию("СозреваниеТермичка");//СозреваниеТеричка 
	
	
	
    Настройки = КомпоновщикНастроек.ПолучитьНастройки();
    
    Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("СкладКИО1", СкладКИО1);
    Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("СкладКИО2", СкладКИО2);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("СкладКИО8", СкладКИО8);
//	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("СкладСозревания", СкладСозревания);
    КомпоновщикНастроек.ЗагрузитьНастройки(Настройки);
    
КонецПроцедуры

